# (C) 1992-2017 Intel Corporation.                            
# Intel, the Intel logo, Intel, MegaCore, NIOS II, Quartus and TalkBack words    
# and logos are trademarks of Intel Corporation or its subsidiaries in the U.S.  
# and/or other countries. Other marks and brands may be claimed as the property  
# of others. See Trademarks on intel.com for full list of Intel trademarks or    
# the Trademarks & Brands Names Database (if Intel) or See www.Intel.com/legal (if Altera) 
# Your use of Intel Corporation's design tools, logic functions and other        
# software and tools, and its AMPP partner logic functions, and any output       
# files any of the foregoing (including device programming or simulation         
# files), and any associated documentation or information are expressly subject  
# to the terms and conditions of the Altera Program License Subscription         
# Agreement, Intel MegaCore Function License Agreement, or other applicable      
# license agreement, including, without limitation, that your use is for the     
# sole purpose of programming logic devices manufactured by Intel and sold by    
# Intel or its authorized distributors.  Please refer to the applicable          
# agreement for further details.                                                 
    


## Generated SDC file "base.sdc"
## This is an autogenerated file created during base compiles.
## It is used in the top revision compile to import all timing constraints 
## from the static region.  This file must be kept in sync with the .qdb file.
## Anytime a base compile is used to create a new .qdb, this file, 
## the .qdb and the pr_base_id.txt file should be copied into the BSP.

## VENDOR  "Altera"
## PROGRAM "Quartus Prime"
## VERSION "Version 16.1.2 Build 202 01/11/2017 SJ Pro Edition"

## DATE    "Wed Jan 18 14:50:18 2017"

##
## DEVICE  "10AX115S2F45I1SG"
##


#**************************************************************
# Time Information
#**************************************************************

set_time_format -unit ns -decimal_places 3



#**************************************************************
# Create Clock
#**************************************************************

create_clock -name {config_clk} -period 20.000 -waveform { 0.000 10.000 } [get_ports {config_clk}]
create_clock -name {pll_ref_clk} -period 6.666 -waveform { 0.000 3.333 } [get_ports {pll_ref_clk}]
create_clock -name {pcie_refclk} -period 10.000 -waveform { 0.000 5.000 } [get_ports {pcie_refclk}]
create_clock -name {kernel_pll_refclk} -period 8.000 -waveform { 0.000 4.000 } [get_ports {kernel_pll_refclk}]
create_clock -name {altera_ts_clk} -period 1000.000 -waveform { 0.000 500.000 } [get_nodes {*temp_sense_a10:temp|sd1~sn_adc_ts_clk.reg}]
create_clock -name {mem_dqs[0]_IN} -period 0.832 -waveform { 0.000 0.417 } [get_ports {mem_dqs[0]}]
create_clock -name {mem_dqs[1]_IN} -period 0.832 -waveform { 0.000 0.417 } [get_ports {mem_dqs[1]}]
create_clock -name {mem_dqs[2]_IN} -period 0.832 -waveform { 0.000 0.417 } [get_ports {mem_dqs[2]}]
create_clock -name {mem_dqs[3]_IN} -period 0.832 -waveform { 0.000 0.417 } [get_ports {mem_dqs[3]}]
create_clock -name {mem_dqs[4]_IN} -period 0.832 -waveform { 0.000 0.417 } [get_ports {mem_dqs[4]}]
create_clock -name {mem_dqs[5]_IN} -period 0.832 -waveform { 0.000 0.417 } [get_ports {mem_dqs[5]}]
create_clock -name {mem_dqs[6]_IN} -period 0.832 -waveform { 0.000 0.417 } [get_ports {mem_dqs[6]}]
create_clock -name {mem_dqs[7]_IN} -period 0.832 -waveform { 0.000 0.417 } [get_ports {mem_dqs[7]}]


#**************************************************************
# Create Generated Clock
#**************************************************************

create_generated_clock -name {pr_clk_enable_dclk_reg2_user_clk} -source [get_ports {config_clk}] -master_clock {config_clk} -invert [get_registers {board_inst|alt_pr|alt_pr|alt_pr_bitstream_host|alt_pr_bitstream_controller_v2|enable_dclk_reg2}] 
create_generated_clock -name {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_vco_clk} -source [get_ports {pll_ref_clk}] -multiply_by 8 -master_clock {pll_ref_clk} [get_nets {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a|arch|arch_inst|pll_inst|phy_clk_phs[0]}] 
create_generated_clock -name {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_vco_clk_1} -source [get_ports {pll_ref_clk}] -multiply_by 8 -master_clock {pll_ref_clk} [get_nets {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a|arch|arch_inst|pll_inst|pll_inst~_Duplicate_1VCOPH0}] 
create_generated_clock -name {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_vco_clk_2} -source [get_ports {pll_ref_clk}] -multiply_by 8 -master_clock {pll_ref_clk} [get_nets {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a|arch|arch_inst|pll_inst|pll_inst~_DuplicateVCOPH0}] 
create_generated_clock -name {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk} -source [get_nets {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a|arch|arch_inst|pll_inst|phy_clk_phs[0]}] -divide_by 4 -phase 11.250 -master_clock {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_vco_clk} [get_pins {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a|arch|arch_inst|io_tiles_wrap_inst|io_tiles_inst|tile_gen[1].tile_ctrl_inst|pa_core_clk_out[0]}] 
create_generated_clock -name {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk} -source [get_nets {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a|arch|arch_inst|pll_inst|phy_clk_phs[0]}] -divide_by 8 -master_clock {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_vco_clk} [get_pins {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a|arch|arch_inst|pll_inst|pll_inst|outclk[3]}] 
create_generated_clock -name {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_0} -source [get_nets {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a|arch|arch_inst|pll_inst|phy_clk_phs[0]}] -divide_by 2 -phase 22.500 -master_clock {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_vco_clk} [get_nets {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a|arch|arch_inst|pll_inst|phy_clk[0]}] 
create_generated_clock -name {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_1} -source [get_nets {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a|arch|arch_inst|pll_inst|pll_inst~_Duplicate_1VCOPH0}] -divide_by 2 -phase 22.500 -master_clock {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_vco_clk_1} [get_nets {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a|arch|arch_inst|pll_inst|pll_inst~_Duplicate_1LOADEN0}] 
create_generated_clock -name {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_2} -source [get_nets {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a|arch|arch_inst|pll_inst|pll_inst~_DuplicateVCOPH0}] -divide_by 2 -phase 22.500 -master_clock {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_vco_clk_2} [get_nets {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a|arch|arch_inst|pll_inst|pll_inst~_DuplicateLOADEN0}] 
create_generated_clock -name {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_0} -source [get_nets {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a|arch|arch_inst|pll_inst|phy_clk_phs[0]}] -divide_by 4 -phase 11.250 -master_clock {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_vco_clk} [get_nets {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a|arch|arch_inst|pll_inst|phy_clk[1]}] 
create_generated_clock -name {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_1} -source [get_nets {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a|arch|arch_inst|pll_inst|pll_inst~_Duplicate_1VCOPH0}] -divide_by 4 -phase 11.250 -master_clock {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_vco_clk_1} [get_nets {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a|arch|arch_inst|pll_inst|pll_inst~_Duplicate_1LVDS_CLK0}] 
create_generated_clock -name {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_2} -source [get_nets {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a|arch|arch_inst|pll_inst|pll_inst~_DuplicateVCOPH0}] -divide_by 4 -phase 11.250 -master_clock {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_vco_clk_2} [get_nets {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a|arch|arch_inst|pll_inst|pll_inst~_DuplicateLVDS_CLK0}] 
create_generated_clock -name {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_wf_clk_0} -source [get_pins {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a|arch|arch_inst|pll_inst|pll_inst|vcoph[0]}] -master_clock {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_vco_clk} [get_registers {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a|arch|arch_inst|io_tiles_wrap_inst|io_tiles_inst|tile_gen[1].lane_gen[0].lane_inst~out_phy_reg}] 
create_generated_clock -name {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_wf_clk_1} -source [get_pins {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a|arch|arch_inst|pll_inst|pll_inst|vcoph[0]}] -master_clock {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_vco_clk} [get_registers {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a|arch|arch_inst|io_tiles_wrap_inst|io_tiles_inst|tile_gen[1].lane_gen[1].lane_inst~out_phy_reg}] 
create_generated_clock -name {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_wf_clk_2} -source [get_pins {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a|arch|arch_inst|pll_inst|pll_inst|vcoph[0]}] -master_clock {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_vco_clk} [get_registers {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a|arch|arch_inst|io_tiles_wrap_inst|io_tiles_inst|tile_gen[1].lane_gen[2].lane_inst~out_phy_reg}] 
create_generated_clock -name {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_wf_clk_3} -source [get_pins {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a|arch|arch_inst|pll_inst|pll_inst~_Duplicate_1|vcoph[0]}] -master_clock {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_vco_clk_1} [get_registers {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a|arch|arch_inst|io_tiles_wrap_inst|io_tiles_inst|tile_gen[0].lane_gen[3].lane_inst~out_phy_reg}] 
create_generated_clock -name {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_wf_clk_4} -source [get_pins {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a|arch|arch_inst|pll_inst|pll_inst~_Duplicate|vcoph[0]}] -master_clock {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_vco_clk_2} [get_registers {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a|arch|arch_inst|io_tiles_wrap_inst|io_tiles_inst|tile_gen[1].lane_gen[3].lane_inst~out_phy_reg}] 
create_generated_clock -name {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_wf_clk_5} -source [get_pins {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a|arch|arch_inst|pll_inst|pll_inst~_Duplicate_1|vcoph[0]}] -master_clock {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_vco_clk_1} [get_registers {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a|arch|arch_inst|io_tiles_wrap_inst|io_tiles_inst|tile_gen[0].lane_gen[2].lane_inst~out_phy_reg}] 
create_generated_clock -name {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_wf_clk_6} -source [get_pins {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a|arch|arch_inst|pll_inst|pll_inst~_Duplicate|vcoph[0]}] -master_clock {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_vco_clk_2} [get_registers {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a|arch|arch_inst|io_tiles_wrap_inst|io_tiles_inst|tile_gen[2].lane_gen[0].lane_inst~out_phy_reg}] 
create_generated_clock -name {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_wf_clk_7} -source [get_pins {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a|arch|arch_inst|pll_inst|pll_inst~_Duplicate_1|vcoph[0]}] -master_clock {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_vco_clk_1} [get_registers {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a|arch|arch_inst|io_tiles_wrap_inst|io_tiles_inst|tile_gen[0].lane_gen[0].lane_inst~out_phy_reg}] 
create_generated_clock -name {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_wf_clk_8} -source [get_pins {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a|arch|arch_inst|pll_inst|pll_inst~_Duplicate_1|vcoph[0]}] -master_clock {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_vco_clk_1} [get_registers {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a|arch|arch_inst|io_tiles_wrap_inst|io_tiles_inst|tile_gen[0].lane_gen[1].lane_inst~out_phy_reg}] 
create_generated_clock -name {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_wf_clk_9} -source [get_pins {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a|arch|arch_inst|pll_inst|pll_inst~_Duplicate|vcoph[0]}] -master_clock {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_vco_clk_2} [get_registers {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a|arch|arch_inst|io_tiles_wrap_inst|io_tiles_inst|tile_gen[2].lane_gen[1].lane_inst~out_phy_reg}] 
create_generated_clock -name {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_wf_clk_10} -source [get_pins {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a|arch|arch_inst|pll_inst|pll_inst~_Duplicate|vcoph[0]}] -master_clock {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_vco_clk_2} [get_registers {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a|arch|arch_inst|io_tiles_wrap_inst|io_tiles_inst|tile_gen[2].lane_gen[2].lane_inst~out_phy_reg}] 
derive_pll_clocks


#**************************************************************
# Set Clock Latency
#**************************************************************



#**************************************************************
# Set Clock Uncertainty
#**************************************************************

set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_2}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -setup 0.213  
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_2}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -hold 0.233  
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_2}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -setup 0.213  
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_2}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -hold 0.233  
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_2}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -setup 0.213  
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_2}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -hold 0.233  
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_2}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -setup 0.213  
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_2}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -hold 0.233  
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_2}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -setup 0.213  
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_2}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -hold 0.233  
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_2}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -setup 0.213  
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_2}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -hold 0.233  
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_2}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -setup 0.213  
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_2}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -hold 0.233  
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_2}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -setup 0.213  
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_2}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -hold 0.233  
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_1}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -setup 0.213  
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_1}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -hold 0.233  
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_1}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -setup 0.213  
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_1}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -hold 0.233  
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_1}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -setup 0.213  
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_1}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -hold 0.233  
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_1}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -setup 0.213  
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_1}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -hold 0.233  
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_1}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -setup 0.213  
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_1}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -hold 0.233  
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_1}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -setup 0.213  
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_1}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -hold 0.233  
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_1}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -setup 0.213  
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_1}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -hold 0.233  
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_1}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -setup 0.213  
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_1}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -hold 0.233  
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_0}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -setup 0.080 -add 
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_0}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -hold 0.100 -add 
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_0}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -setup 0.080 -add 
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_0}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -hold 0.100 -add 
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_0}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -setup 0.080 -add 
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_0}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -hold 0.100 -add 
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_0}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -setup 0.080 -add 
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_0}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -hold 0.100 -add 
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_0}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -setup 0.080 -add 
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_0}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -hold 0.100 -add 
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_0}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -setup 0.080 -add 
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_0}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -hold 0.100 -add 
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_0}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -setup 0.080 -add 
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_0}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -hold 0.100 -add 
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_0}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -setup 0.080 -add 
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_0}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -hold 0.100 -add 
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_2}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -setup 0.213  
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_2}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -hold 0.233  
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_2}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -setup 0.213  
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_2}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -hold 0.233  
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_2}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -setup 0.213  
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_2}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -hold 0.233  
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_2}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -setup 0.213  
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_2}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -hold 0.233  
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_2}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -setup 0.213  
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_2}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -hold 0.233  
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_2}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -setup 0.213  
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_2}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -hold 0.233  
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_2}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -setup 0.213  
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_2}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -hold 0.233  
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_2}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -setup 0.213  
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_2}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -hold 0.233  
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_1}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -setup 0.213  
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_1}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -hold 0.233  
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_1}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -setup 0.213  
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_1}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -hold 0.233  
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_1}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -setup 0.213  
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_1}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -hold 0.233  
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_1}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -setup 0.213  
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_1}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -hold 0.233  
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_1}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -setup 0.213  
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_1}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -hold 0.233  
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_1}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -setup 0.213  
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_1}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -hold 0.233  
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_1}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -setup 0.213  
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_1}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -hold 0.233  
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_1}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -setup 0.213  
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_1}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -hold 0.233  
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_0}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -setup 0.080 -add 
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_0}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -hold 0.100 -add 
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_0}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -setup 0.080 -add 
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_0}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -hold 0.100 -add 
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_0}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -setup 0.080 -add 
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_0}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -hold 0.100 -add 
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_0}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -setup 0.080 -add 
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_0}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -hold 0.100 -add 
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_0}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -setup 0.080 -add 
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_0}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -hold 0.100 -add 
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_0}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -setup 0.080 -add 
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_0}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -hold 0.100 -add 
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_0}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -setup 0.080 -add 
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_0}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -hold 0.100 -add 
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_0}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -setup 0.080 -add 
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_0}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -hold 0.100 -add 
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_2}] -setup 0.243  
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_2}] -hold 0.269  
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_2}] -setup 0.243  
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_2}] -hold 0.269  
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_1}] -setup 0.243  
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_1}] -hold 0.269  
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_1}] -setup 0.243  
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_1}] -hold 0.269  
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_0}] -setup 0.110 -add 
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_0}] -hold 0.136 -add 
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_0}] -setup 0.110 -add 
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_0}] -hold 0.136 -add 
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_2}] -setup 0.243  
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_2}] -hold 0.269  
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_2}] -setup 0.243  
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_2}] -hold 0.269  
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_1}] -setup 0.243  
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_1}] -hold 0.269  
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_1}] -setup 0.243  
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_1}] -hold 0.269  
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_0}] -setup 0.110 -add 
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_0}] -hold 0.136 -add 
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_0}] -setup 0.110 -add 
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_0}] -hold 0.136 -add 
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}]  0.000 -add -enable_same_physical_edge
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}]  0.000 -add -enable_same_physical_edge
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}]  0.000 -add 
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}]  0.000 -add 
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_2}] -setup 0.243  
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_2}] -hold 0.269  
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_2}] -setup 0.243  
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_2}] -hold 0.269  
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_1}] -setup 0.243  
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_1}] -hold 0.269  
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_1}] -setup 0.243  
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_1}] -hold 0.269  
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_0}] -setup 0.110 -add 
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_0}] -hold 0.136 -add 
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_0}] -setup 0.110 -add 
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_0}] -hold 0.136 -add 
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_2}] -setup 0.243  
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_2}] -hold 0.269  
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_2}] -setup 0.243  
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_2}] -hold 0.269  
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_1}] -setup 0.243  
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_1}] -hold 0.269  
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_1}] -setup 0.243  
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_1}] -hold 0.269  
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_0}] -setup 0.110 -add 
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_0}] -hold 0.136 -add 
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_0}] -setup 0.110 -add 
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_0}] -hold 0.136 -add 
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}]  0.000 -add -enable_same_physical_edge
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}]  0.000 -add -enable_same_physical_edge
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}]  0.000 -add 
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}]  0.000 -add 
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_2}] -setup 0.243  
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_2}] -hold 0.269  
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_2}] -setup 0.243  
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_2}] -hold 0.269  
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_1}] -setup 0.243  
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_1}] -hold 0.269  
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_1}] -setup 0.243  
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_1}] -hold 0.269  
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_0}] -setup 0.110 -add 
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_0}] -hold 0.136 -add 
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_0}] -setup 0.110 -add 
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_0}] -hold 0.136 -add 
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_2}] -setup 0.243  
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_2}] -hold 0.269  
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_2}] -setup 0.243  
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_2}] -hold 0.269  
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_1}] -setup 0.243  
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_1}] -hold 0.269  
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_1}] -setup 0.243  
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_1}] -hold 0.269  
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_0}] -setup 0.110 -add 
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_0}] -hold 0.136 -add 
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_0}] -setup 0.110 -add 
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_0}] -hold 0.136 -add 
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}]  0.000 -add 
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}]  0.000 -add 
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}]  0.000 -add -enable_same_physical_edge
set_clock_uncertainty -rise_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}]  0.000 -add -enable_same_physical_edge
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_2}] -setup 0.243  
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_2}] -hold 0.269  
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_2}] -setup 0.243  
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_2}] -hold 0.269  
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_1}] -setup 0.243  
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_1}] -hold 0.269  
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_1}] -setup 0.243  
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_1}] -hold 0.269  
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_0}] -setup 0.110 -add 
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_0}] -hold 0.136 -add 
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_0}] -setup 0.110 -add 
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_l_0}] -hold 0.136 -add 
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_2}] -setup 0.243  
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_2}] -hold 0.269  
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_2}] -setup 0.243  
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_2}] -hold 0.269  
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_1}] -setup 0.243  
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_1}] -hold 0.269  
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_1}] -setup 0.243  
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_1}] -hold 0.269  
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_0}] -setup 0.110 -add 
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_0}] -hold 0.136 -add 
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_0}] -setup 0.110 -add 
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_phy_clk_0}] -hold 0.136 -add 
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}]  0.000 -add 
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_cal_slave_clk}]  0.000 -add 
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -rise_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}]  0.000 -add -enable_same_physical_edge
set_clock_uncertainty -fall_from [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}] -fall_to [get_clocks {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a_core_usr_clk}]  0.000 -add -enable_same_physical_edge
derive_clock_uncertainty


#**************************************************************
# Set Input Delay
#**************************************************************

set_input_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dbi_n[0]}]
set_input_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dbi_n[1]}]
set_input_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dbi_n[2]}]
set_input_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dbi_n[3]}]
set_input_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dbi_n[4]}]
set_input_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dbi_n[5]}]
set_input_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dbi_n[6]}]
set_input_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dbi_n[7]}]
set_input_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[0]}]
set_input_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[1]}]
set_input_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[2]}]
set_input_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[3]}]
set_input_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[4]}]
set_input_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[5]}]
set_input_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[6]}]
set_input_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[7]}]
set_input_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[8]}]
set_input_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[9]}]
set_input_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[10]}]
set_input_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[11]}]
set_input_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[12]}]
set_input_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[13]}]
set_input_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[14]}]
set_input_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[15]}]
set_input_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[16]}]
set_input_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[17]}]
set_input_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[18]}]
set_input_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[19]}]
set_input_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[20]}]
set_input_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[21]}]
set_input_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[22]}]
set_input_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[23]}]
set_input_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[24]}]
set_input_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[25]}]
set_input_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[26]}]
set_input_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[27]}]
set_input_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[28]}]
set_input_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[29]}]
set_input_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[30]}]
set_input_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[31]}]
set_input_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[32]}]
set_input_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[33]}]
set_input_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[34]}]
set_input_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[35]}]
set_input_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[36]}]
set_input_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[37]}]
set_input_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[38]}]
set_input_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[39]}]
set_input_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[40]}]
set_input_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[41]}]
set_input_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[42]}]
set_input_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[43]}]
set_input_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[44]}]
set_input_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[45]}]
set_input_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[46]}]
set_input_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[47]}]
set_input_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[48]}]
set_input_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[49]}]
set_input_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[50]}]
set_input_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[51]}]
set_input_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[52]}]
set_input_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[53]}]
set_input_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[54]}]
set_input_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[55]}]
set_input_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[56]}]
set_input_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[57]}]
set_input_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[58]}]
set_input_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[59]}]
set_input_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[60]}]
set_input_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[61]}]
set_input_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[62]}]
set_input_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[63]}]


#**************************************************************
# Set Output Delay
#**************************************************************

set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_a[0]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_a[1]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_a[2]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_a[3]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_a[4]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_a[5]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_a[6]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_a[7]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_a[8]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_a[9]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_a[10]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_a[11]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_a[12]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_a[13]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_a[14]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_a[15]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_a[16]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_act_n[0]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_ba[0]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_ba[1]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_bg[0]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_ck[0]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_ck_n[0]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_cke[0]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_cs_n[0]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dbi_n[0]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dbi_n[1]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dbi_n[2]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dbi_n[3]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dbi_n[4]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dbi_n[5]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dbi_n[6]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dbi_n[7]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[0]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[1]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[2]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[3]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[4]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[5]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[6]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[7]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[8]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[9]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[10]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[11]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[12]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[13]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[14]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[15]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[16]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[17]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[18]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[19]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[20]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[21]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[22]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[23]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[24]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[25]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[26]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[27]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[28]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[29]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[30]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[31]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[32]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[33]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[34]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[35]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[36]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[37]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[38]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[39]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[40]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[41]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[42]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[43]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[44]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[45]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[46]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[47]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[48]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[49]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[50]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[51]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[52]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[53]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[54]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[55]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[56]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[57]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[58]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[59]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[60]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[61]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[62]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dq[63]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dqs[0]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dqs[1]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dqs[2]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dqs[3]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dqs[4]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dqs[5]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dqs[6]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dqs[7]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dqs_n[0]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dqs_n[1]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dqs_n[2]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dqs_n[3]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dqs_n[4]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dqs_n[5]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dqs_n[6]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_dqs_n[7]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_odt[0]}]
set_output_delay -add_delay  -clock [get_clocks {pll_ref_clk}]  0.000 [get_ports {mem_reset_n[0]}]


#**************************************************************
# Set Clock Groups
#**************************************************************

set_clock_groups -asynchronous -group [get_clocks {  config_clk  }] -group [get_clocks {  a10_internal_oscillator_clock0  }] -group [get_clocks {  altera_ts_clk  }] -group [get_clocks {  pll_ref_clk  }] -group [get_clocks {  kernel_pll_refclk  }] -group [get_clocks {
   pcie_refclk  board_inst|pcie|*  }] -group [get_clocks {  board_inst|kernel_clk_gen|kernel_clk_gen|kernel_pll|*  }] -group [get_clocks {  acl_hmcc_wrapper_inst|*  }] -group [get_clocks {  altera_reserved_tck  }] -group [get_clocks {  mem_dqs[0]_IN  mem_dqs[1]_IN  mem_dqs[2]_IN  mem_dqs[3]_IN  mem_dqs[4]_IN  mem_dqs[5]_IN  mem_dqs[6]_IN  mem_dqs[7]_IN  board_inst|acl_ddr4_a10|*  }] 


#**************************************************************
# Set False Path
#**************************************************************

set_false_path -to [get_keepers {*altera_std_synchronizer:*|din_s1}]
set_false_path -from [get_fanins -asynch [get_keepers {*app_rstn_altpcie_reset_delay_sync_altpcie_a10_hip_hwtcl*rs_meta[*]}]] -to [get_keepers {*app_rstn_altpcie_reset_delay_sync_altpcie_a10_hip_hwtcl*rs_meta[*]}]
set_false_path -from [get_fanins -asynch [get_keepers {*por_sync_altpcie_reset_delay_sync*rs_meta[*]}]] -to [get_keepers {*por_sync_altpcie_reset_delay_sync*rs_meta[*]}]
set_false_path -from [get_fanins -asynch [get_keepers {*npor_sync_altpcie_reset_delay_sync_altpcie_rs_a10_hip*rs_meta[*]}]] -to [get_keepers {*npor_sync_altpcie_reset_delay_sync_altpcie_rs_a10_hip*rs_meta[*]}]
set_false_path -from [get_fanins -asynch [get_keepers {*app_rstn_altpcie_reset_delay_sync_altpcie_a10_hip_hwtcl*rs_meta[*]}]] -to [get_keepers {*app_rstn_altpcie_reset_delay_sync_altpcie_a10_hip_hwtcl*rs_meta[*]}]
set_false_path -from [get_fanins -asynch [get_keepers {*por_sync_altpcie_reset_delay_sync*rs_meta[*]}]] -to [get_keepers {*por_sync_altpcie_reset_delay_sync*rs_meta[*]}]
set_false_path -from [get_fanins -asynch [get_keepers {*npor_sync_altpcie_reset_delay_sync_altpcie_rs_a10_hip*rs_meta[*]}]] -to [get_keepers {*npor_sync_altpcie_reset_delay_sync_altpcie_rs_a10_hip*rs_meta[*]}]
set_false_path -from [get_fanins -asynch [get_keepers {*app_rstn_altpcie_reset_delay_sync_altpcie_a10_hip_hwtcl*rs_meta[*]}]] -to [get_keepers {*app_rstn_altpcie_reset_delay_sync_altpcie_a10_hip_hwtcl*rs_meta[*]}]
set_false_path -from [get_fanins -asynch [get_keepers {*por_sync_altpcie_reset_delay_sync*rs_meta[*]}]] -to [get_keepers {*por_sync_altpcie_reset_delay_sync*rs_meta[*]}]
set_false_path -from [get_fanins -asynch [get_keepers {*npor_sync_altpcie_reset_delay_sync_altpcie_rs_a10_hip*rs_meta[*]}]] -to [get_keepers {*npor_sync_altpcie_reset_delay_sync_altpcie_rs_a10_hip*rs_meta[*]}]
set_false_path -hold -to [get_keepers {*pld_clk_in_use_altpcie_sc_bitsync*altpcie_sc_bitsync_meta_dff[*]}]
set_false_path -hold -to [get_keepers {*reset_status_altpcie_sc_bitsync*altpcie_sc_bitsync_meta_dff[*]}]
set_false_path -from [get_keepers {*rdptr_g*}] -to [get_keepers {*ws_dgrp|dffpipe_3v8:dffpipe16|dffe17a*}]
set_false_path -from [get_keepers {*delayed_wrptr_g*}] -to [get_keepers {*rs_dgwp|dffpipe_2v8:dffpipe13|dffe14a*}]
set_false_path -from [get_ports {perstl0_n}] 
set_false_path -from [get_registers {*|altpcie_a10_hip_pipen1b:altpcie_a10_hip_pipen1b|*altpcie_rs_a10_hip|hiprst}] -to [get_registers {*|altpcie_a10_hip_pipen1b:altpcie_a10_hip_pipen1b|wys~ch0_pcs_chnl_hip_clk_out[*].reg}]
set_false_path -to [get_pins -compatibility_mode {*twentynm_xcvr_native_inst|*inst_twentynm_pcs|*twentynm_hssi_*_pld_pcs_interface*|pld_8g_g3_rx_pld_rst_n*}]
set_false_path -to [get_pins -compatibility_mode {*twentynm_xcvr_native_inst|*inst_twentynm_pcs|*twentynm_hssi_*_pld_pcs_interface*|pld_8g_rxpolarity*}]
set_false_path -to [get_pins -compatibility_mode {*twentynm_xcvr_native_inst|*inst_twentynm_pcs|*twentynm_hssi_*_pld_pcs_interface*|pld_pmaif_rx_pld_rst_n*}]
set_false_path -to [get_pins -compatibility_mode {*twentynm_xcvr_native_inst|*inst_twentynm_pcs|*twentynm_hssi_*_pld_pcs_interface*|pld_bitslip*}]
set_false_path -to [get_pins -compatibility_mode {*twentynm_xcvr_native_inst|*inst_twentynm_pcs|*twentynm_hssi_*_pld_pcs_interface*|pld_rx_prbs_err_clr*}]
set_false_path -to [get_pins -compatibility_mode {*twentynm_xcvr_native_inst|*inst_twentynm_pcs|*twentynm_hssi_*_pld_pcs_interface*|pld_polinv_tx*}]
set_false_path -to [get_pins -compatibility_mode {*twentynm_xcvr_native_inst|*inst_twentynm_pcs|*twentynm_hssi_*_pld_pcs_interface*|pld_polinv_rx*}]
set_false_path -from [get_registers {*|aggregate_uniphy_status*}] 
set_false_path -to [get_registers {*|aggregate_uniphy_status*}]
set_false_path -from [get_registers {*|mem_organization*}] 
set_false_path -to [get_keepers {{mem_a[0]} {mem_a[1]} {mem_a[2]} {mem_a[3]} {mem_a[4]} {mem_a[5]} {mem_a[6]} {mem_a[7]} {mem_a[8]} {mem_a[9]} {mem_a[10]} {mem_a[11]} {mem_a[12]} {mem_a[13]} {mem_a[14]} {mem_a[15]} {mem_a[16]} {mem_act_n[0]} {mem_ba[0]} {mem_ba[1]} {mem_bg[0]} {mem_cke[0]} {mem_cs_n[0]} {mem_odt[0]}}]
set_false_path -through [get_pins {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a|arch|arch_inst|io_tiles_wrap_inst|io_tiles_inst|tile_gen[*].lane_gen[*].lane_inst|core_dll[2]}]  -to [get_keepers {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a*|tile_gen[*].lane_gen[*].lane_inst~lane_reg}]
set_false_path -to [get_keepers {{mem_dq[0]} {mem_dq[1]} {mem_dq[2]} {mem_dq[3]} {mem_dq[4]} {mem_dq[5]} {mem_dq[6]} {mem_dq[7]} {mem_dq[8]} {mem_dq[9]} {mem_dq[10]} {mem_dq[11]} {mem_dq[12]} {mem_dq[13]} {mem_dq[14]} {mem_dq[15]} {mem_dq[16]} {mem_dq[17]} {mem_dq[18]} {mem_dq[19]} {mem_dq[20]} {mem_dq[21]} {mem_dq[22]} {mem_dq[23]} {mem_dq[24]} {mem_dq[25]} {mem_dq[26]} {mem_dq[27]} {mem_dq[28]} {mem_dq[29]} {mem_dq[30]} {mem_dq[31]} {mem_dq[32]} {mem_dq[33]} {mem_dq[34]} {mem_dq[35]} {mem_dq[36]} {mem_dq[37]} {mem_dq[38]} {mem_dq[39]} {mem_dq[40]} {mem_dq[41]} {mem_dq[42]} {mem_dq[43]} {mem_dq[44]} {mem_dq[45]} {mem_dq[46]} {mem_dq[47]} {mem_dq[48]} {mem_dq[49]} {mem_dq[50]} {mem_dq[51]} {mem_dq[52]} {mem_dq[53]} {mem_dq[54]} {mem_dq[55]} {mem_dq[56]} {mem_dq[57]} {mem_dq[58]} {mem_dq[59]} {mem_dq[60]} {mem_dq[61]} {mem_dq[62]} {mem_dq[63]}}]
set_false_path -from [get_keepers {{mem_dq[0]} {mem_dq[1]} {mem_dq[2]} {mem_dq[3]} {mem_dq[4]} {mem_dq[5]} {mem_dq[6]} {mem_dq[7]} {mem_dq[8]} {mem_dq[9]} {mem_dq[10]} {mem_dq[11]} {mem_dq[12]} {mem_dq[13]} {mem_dq[14]} {mem_dq[15]} {mem_dq[16]} {mem_dq[17]} {mem_dq[18]} {mem_dq[19]} {mem_dq[20]} {mem_dq[21]} {mem_dq[22]} {mem_dq[23]} {mem_dq[24]} {mem_dq[25]} {mem_dq[26]} {mem_dq[27]} {mem_dq[28]} {mem_dq[29]} {mem_dq[30]} {mem_dq[31]} {mem_dq[32]} {mem_dq[33]} {mem_dq[34]} {mem_dq[35]} {mem_dq[36]} {mem_dq[37]} {mem_dq[38]} {mem_dq[39]} {mem_dq[40]} {mem_dq[41]} {mem_dq[42]} {mem_dq[43]} {mem_dq[44]} {mem_dq[45]} {mem_dq[46]} {mem_dq[47]} {mem_dq[48]} {mem_dq[49]} {mem_dq[50]} {mem_dq[51]} {mem_dq[52]} {mem_dq[53]} {mem_dq[54]} {mem_dq[55]} {mem_dq[56]} {mem_dq[57]} {mem_dq[58]} {mem_dq[59]} {mem_dq[60]} {mem_dq[61]} {mem_dq[62]} {mem_dq[63]}}] 
set_false_path -to [get_keepers {{mem_dbi_n[0]} {mem_dbi_n[1]} {mem_dbi_n[2]} {mem_dbi_n[3]} {mem_dbi_n[4]} {mem_dbi_n[5]} {mem_dbi_n[6]} {mem_dbi_n[7]}}]
set_false_path -from [get_keepers {{mem_dbi_n[0]} {mem_dbi_n[1]} {mem_dbi_n[2]} {mem_dbi_n[3]} {mem_dbi_n[4]} {mem_dbi_n[5]} {mem_dbi_n[6]} {mem_dbi_n[7]}}] 
set_false_path -to [get_keepers {{mem_dqs[0]} {mem_dqs[1]} {mem_dqs[2]} {mem_dqs[3]} {mem_dqs[4]} {mem_dqs[5]} {mem_dqs[6]} {mem_dqs[7]}}]
set_false_path -to [get_keepers {{mem_dqs_n[0]} {mem_dqs_n[1]} {mem_dqs_n[2]} {mem_dqs_n[3]} {mem_dqs_n[4]} {mem_dqs_n[5]} {mem_dqs_n[6]} {mem_dqs_n[7]}}]
set_false_path -from [get_keepers {{mem_dqs[0]} {mem_dqs[1]} {mem_dqs[2]} {mem_dqs[3]} {mem_dqs[4]} {mem_dqs[5]} {mem_dqs[6]} {mem_dqs[7]}}] 
set_false_path -from [get_keepers {{mem_dqs_n[0]} {mem_dqs_n[1]} {mem_dqs_n[2]} {mem_dqs_n[3]} {mem_dqs_n[4]} {mem_dqs_n[5]} {mem_dqs_n[6]} {mem_dqs_n[7]}}] 
set_false_path -to [get_keepers {{mem_ck[0]}}]
set_false_path -to [get_keepers {{mem_ck_n[0]}}]
set_false_path -to [get_keepers {{mem_reset_n[0]}}]
set_false_path -from [get_keepers {{mem_reset_n[0]}}] 
set_false_path -to [get_pins -nocase -compatibility_mode {*|alt_rst_sync_uq1|altera_reset_synchronizer_int_chain*|clrn}]
set_false_path -to [get_keepers {leds[*]}]
set_false_path -from [get_keepers {board_inst|por_reset_counter|por_reset_counter|sw_reset_n_out}] 
set_false_path -from [get_keepers {board_inst|alt_pr|alt_pr|alt_pr_cb_host|alt_pr_cb_controller_v2|freeze_reg}] 
set_false_path -to [get_keepers {freeze_wrapper_inst|kernel_system_inst|*|*|kernel|twoXclock_consumer_NO_SHIFT_REG}]


#**************************************************************
# Set Multicycle Path
#**************************************************************

set_multicycle_path -setup -end -to [get_keepers {*pld_clk_in_use_altpcie_sc_bitsync*altpcie_sc_bitsync_meta_dff[*]}] 3
set_multicycle_path -setup -end -to [get_keepers {*reset_status_altpcie_sc_bitsync*altpcie_sc_bitsync_meta_dff[*]}] 3
set_multicycle_path -setup -start -from [get_keepers {board_inst|alt_pr|alt_pr|alt_pr_cb_host|alt_pr_cb_controller_v2|alt_pr_cb_interface|m_prblock~cs_css/pr_clk_core.reg}] 2
set_multicycle_path -hold -start -from [get_keepers {board_inst|alt_pr|alt_pr|alt_pr_cb_host|alt_pr_cb_controller_v2|alt_pr_cb_interface|m_prblock~cs_css/pr_clk_core.reg}] 1
set_multicycle_path -setup -start -from [get_keepers {board_inst|alt_pr|alt_pr|alt_pr_cb_host|alt_pr_cb_controller_v2|pr_request_reg}] -to [get_keepers {board_inst|alt_pr|alt_pr|alt_pr_cb_host|alt_pr_cb_controller_v2|alt_pr_cb_interface|m_prblock~cs_css/pr_clk_core.reg}] 2
set_multicycle_path -hold -start -from [get_keepers {board_inst|alt_pr|alt_pr|alt_pr_cb_host|alt_pr_cb_controller_v2|pr_request_reg}] -to [get_keepers {board_inst|alt_pr|alt_pr|alt_pr_cb_host|alt_pr_cb_controller_v2|alt_pr_cb_interface|m_prblock~cs_css/pr_clk_core.reg}] 1
set_multicycle_path -setup -end -through [get_pins -nocase -compatibility_mode {*|altpcie_a10_hip_pipen1b:altpcie_a10_hip_pipen1b|wys|tl_cfg_add[*]}]  2
set_multicycle_path -hold -end -through [get_pins -nocase -compatibility_mode {*|altpcie_a10_hip_pipen1b:altpcie_a10_hip_pipen1b|wys|tl_cfg_add[*]}]  2
set_multicycle_path -setup -end -through [get_pins -nocase -compatibility_mode {*|altpcie_a10_hip_pipen1b:altpcie_a10_hip_pipen1b|wys|tl_cfg_ctl[*]}]  2
set_multicycle_path -hold -end -through [get_pins -nocase -compatibility_mode {*|altpcie_a10_hip_pipen1b:altpcie_a10_hip_pipen1b|wys|tl_cfg_ctl[*]}]  2
set_multicycle_path -setup -start -from [get_keepers {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a|arch|arch_inst|io_tiles_wrap_inst|io_tiles_inst|tile_gen[*].tile_ctrl_inst~hmc_reg0}] -through [get_pins {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a|arch|arch_inst|io_tiles_wrap_inst|io_tiles_inst|tile_gen[*].tile_ctrl_inst|ctl2core_avl_cmd_ready}]  2
set_multicycle_path -hold -start -from [get_keepers {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a|arch|arch_inst|io_tiles_wrap_inst|io_tiles_inst|tile_gen[*].tile_ctrl_inst~hmc_reg0}] -through [get_pins {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a|arch|arch_inst|io_tiles_wrap_inst|io_tiles_inst|tile_gen[*].tile_ctrl_inst|ctl2core_avl_cmd_ready}]  1
set_multicycle_path -setup -start -from [get_keepers {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a|arch|arch_inst|io_tiles_wrap_inst|io_tiles_inst|tile_gen[*].tile_ctrl_inst~hmc_reg0}] -through [get_pins {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a|arch|arch_inst|io_tiles_wrap_inst|io_tiles_inst|tile_gen[*].tile_ctrl_inst|afi_ctl2core[18]}]  -to [get_keepers {*reset*}] 4
set_multicycle_path -hold -start -from [get_keepers {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a|arch|arch_inst|io_tiles_wrap_inst|io_tiles_inst|tile_gen[*].tile_ctrl_inst~hmc_reg0}] -through [get_pins {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a|arch|arch_inst|io_tiles_wrap_inst|io_tiles_inst|tile_gen[*].tile_ctrl_inst|afi_ctl2core[18]}]  -to [get_keepers {*reset*}] 3
set_multicycle_path -setup -end -from [get_clocks *] -through [get_pins {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a|arch|arch_inst|io_tiles_wrap_inst|io_tiles_inst|tile_gen[*].lane_gen[*].lane_inst|reset_n}]  -to [get_keepers {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a|arch|arch_inst|io_tiles_wrap_inst|io_tiles_inst|tile_gen[*].lane_gen[*].lane_inst*}] 4
set_multicycle_path -hold -end -from [get_clocks *] -through [get_pins {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a|arch|arch_inst|io_tiles_wrap_inst|io_tiles_inst|tile_gen[*].lane_gen[*].lane_inst|reset_n}]  -to [get_keepers {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a|arch|arch_inst|io_tiles_wrap_inst|io_tiles_inst|tile_gen[*].lane_gen[*].lane_inst*}] 3
set_multicycle_path -setup -end -from [get_clocks *] -through [get_pins {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a|arch|arch_inst|io_tiles_wrap_inst|io_tiles_inst|tile_gen[*].tile_ctrl_inst*|global_reset_n}]  -to [get_keepers {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a|arch|arch_inst|io_tiles_wrap_inst|io_tiles_inst|tile_gen[*].tile_ctrl_inst*}] 4
set_multicycle_path -hold -end -from [get_clocks *] -through [get_pins {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a|arch|arch_inst|io_tiles_wrap_inst|io_tiles_inst|tile_gen[*].tile_ctrl_inst*|global_reset_n}]  -to [get_keepers {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a|arch|arch_inst|io_tiles_wrap_inst|io_tiles_inst|tile_gen[*].tile_ctrl_inst*}] 3
set_multicycle_path -setup -end -from [get_clocks *] -through [get_pins {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a|arch|arch_inst|io_aux_inst|io_aux|core_usr_reset_n}]  -to [get_keepers {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a|arch|arch_inst|io_aux_inst|io_aux*}] 4
set_multicycle_path -hold -end -from [get_clocks *] -through [get_pins {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a|arch|arch_inst|io_aux_inst|io_aux|core_usr_reset_n}]  -to [get_keepers {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a|arch|arch_inst|io_aux_inst|io_aux*}] 3
set_multicycle_path -setup -end -through [get_pins {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a|arch|arch_inst|non_hps.core_clks_rsts_inst|*reset_sync*|clrn}]  -to [get_keepers {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a|arch|arch_inst|non_hps.core_clks_rsts_inst|*reset_sync*}] 4
set_multicycle_path -hold -end -through [get_pins {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a|arch|arch_inst|non_hps.core_clks_rsts_inst|*reset_sync*|clrn}]  -to [get_keepers {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a|arch|arch_inst|non_hps.core_clks_rsts_inst|*reset_sync*}] 3
set_multicycle_path -setup -end -from [get_keepers {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a|arch|arch_inst|non_hps.core_clks_rsts_inst|counter_lock}] -to [get_keepers {*reset*}] 3
set_multicycle_path -hold -end -from [get_keepers {board_inst|acl_ddr4_a10|acl_ddr4_a10_core|ddr4a|ddr4a|arch|arch_inst|non_hps.core_clks_rsts_inst|counter_lock}] -to [get_keepers {*reset*}] 2
set_multicycle_path -setup -end -from [get_keepers {board_inst|kernel_interface|kernel_interface|reset_controller_sw|alt_rst_sync_uq1|altera_reset_synchronizer_int_chain_out}] 4
set_multicycle_path -hold -end -from [get_keepers {board_inst|kernel_interface|kernel_interface|reset_controller_sw|alt_rst_sync_uq1|altera_reset_synchronizer_int_chain_out}] 3
set_multicycle_path -setup -end -from [get_keepers {freeze_wrapper_inst|kernel_system_clock_reset_reset_reset_n}] 4
set_multicycle_path -hold -end -from [get_keepers {freeze_wrapper_inst|kernel_system_clock_reset_reset_reset_n}] 3


#**************************************************************
# Set Maximum Delay
#**************************************************************

set_max_delay -to [get_pins -compatibility_mode {*twentynm_xcvr_native_inst|*inst_twentynm_pcs|*twentynm_hssi_*_pld_pcs_interface*|pld_8g_g3_tx_pld_rst_n}] 50.000
set_max_delay -to [get_pins -compatibility_mode {*twentynm_xcvr_native_inst|*inst_twentynm_pcs|*twentynm_hssi_*_pld_pcs_interface*|pld_pma_txpma_rstb}] 20.000
set_max_delay -to [get_pins -compatibility_mode {*twentynm_xcvr_native_inst|*inst_twentynm_pcs|*twentynm_hssi_*_pld_pcs_interface*|pld_pma_rxpma_rstb}] 20.000
set_max_delay -from [get_registers {*altera_avalon_st_clock_crosser:*|in_data_buffer*}] -to [get_registers {*altera_avalon_st_clock_crosser:*|out_data_buffer*}] 100.000
set_max_delay -from [all_registers] -to [get_registers {*altera_avalon_st_clock_crosser:*|altera_std_synchronizer_nocut:*|din_s1}] 100.000
set_max_delay -from [get_registers {*|in_wr_ptr_gray[*]}] -to [get_registers {*|altera_dcfifo_synchronizer_bundle:write_crosser|altera_std_synchronizer_nocut:sync[*].u|din_s1}] 100.000
set_max_delay -from [get_registers {*|out_rd_ptr_gray[*]}] -to [get_registers {*|altera_dcfifo_synchronizer_bundle:read_crosser|altera_std_synchronizer_nocut:sync[*].u|din_s1}] 100.000


#**************************************************************
# Set Minimum Delay
#**************************************************************

set_min_delay -to [get_pins -compatibility_mode {*twentynm_xcvr_native_inst|*inst_twentynm_pcs|*twentynm_hssi_*_pld_pcs_interface*|pld_8g_g3_tx_pld_rst_n}] -50.000
set_min_delay -to [get_pins -compatibility_mode {*twentynm_xcvr_native_inst|*inst_twentynm_pcs|*twentynm_hssi_*_pld_pcs_interface*|pld_pma_txpma_rstb}] -10.000
set_min_delay -to [get_pins -compatibility_mode {*twentynm_xcvr_native_inst|*inst_twentynm_pcs|*twentynm_hssi_*_pld_pcs_interface*|pld_pma_rxpma_rstb}] -10.000
set_min_delay -from [get_registers {*altera_avalon_st_clock_crosser:*|in_data_buffer*}] -to [get_registers {*altera_avalon_st_clock_crosser:*|out_data_buffer*}] -100.000
set_min_delay -from [all_registers] -to [get_registers {*altera_avalon_st_clock_crosser:*|altera_std_synchronizer_nocut:*|din_s1}] -100.000
set_min_delay -from [get_registers {*|in_wr_ptr_gray[*]}] -to [get_registers {*|altera_dcfifo_synchronizer_bundle:write_crosser|altera_std_synchronizer_nocut:sync[*].u|din_s1}] -100.000
set_min_delay -from [get_registers {*|out_rd_ptr_gray[*]}] -to [get_registers {*|altera_dcfifo_synchronizer_bundle:read_crosser|altera_std_synchronizer_nocut:sync[*].u|din_s1}] -100.000


#**************************************************************
# Set Input Transition
#**************************************************************



#**************************************************************
# Set Net Delay
#**************************************************************

set_net_delay -max -value_multiplier 0.800 -get_value_from_clock_period dst_clock_period -from [get_pins -compatibility_mode {*|in_wr_ptr_gray[*]*}] -to [get_registers {*|altera_dcfifo_synchronizer_bundle:write_crosser|altera_std_synchronizer_nocut:sync[*].u|din_s1}]
set_net_delay -max -value_multiplier 0.800 -get_value_from_clock_period dst_clock_period -from [get_pins -compatibility_mode {*|out_rd_ptr_gray[*]*}] -to [get_registers {*|altera_dcfifo_synchronizer_bundle:read_crosser|altera_std_synchronizer_nocut:sync[*].u|din_s1}]
set_net_delay -max -value_multiplier 0.800 -get_value_from_clock_period dst_clock_period -from [get_registers {*altera_avalon_st_clock_crosser:*|in_data_buffer*}] -to [get_registers {*altera_avalon_st_clock_crosser:*|out_data_buffer*}]
set_net_delay -max -value_multiplier 0.800 -get_value_from_clock_period dst_clock_period -from [all_registers] -to [get_registers {*altera_avalon_st_clock_crosser:*|altera_std_synchronizer_nocut:*|din_s1}]
